TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/driverlib/dma.h
//###########################################################################
//
// FILE:   dma.h
//
// TITLE:  C28x DMA driver.
//
//###########################################################################
// $Copyright:
// Copyright (C) 2022 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef DMA_H
#define DMA_H

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

//*****************************************************************************
//
//! \addtogroup dma_api DMA
//! \brief This module is used for DMA configurations.
//! @{
//
//*****************************************************************************

#include <stdbool.h>
#include <stdint.h>
#include "inc/hw_dma.h"
#include "inc/hw_memmap.h"
#include "inc/hw_sysctl.h"
#include "inc/hw_types.h"
#include "cpu.h"
#include "debug.h"

//*****************************************************************************
//
// Values that can be passed to DMA_configMode() as the config parameter.
//
//*****************************************************************************
//! Only one burst transfer performed per trigger.
#define DMA_CFG_ONESHOT_DISABLE     0U
//! Burst transfers occur without additional event triggers after the first.
#define DMA_CFG_ONESHOT_ENABLE      DMA_MODE_ONESHOT

//! DMA channel will be disabled at the end of a transfer.
#define DMA_CFG_CONTINUOUS_DISABLE  0U
//! DMA reinitializes when the transfer count is zero and waits for a trigger.
#define DMA_CFG_CONTINUOUS_ENABLE   DMA_MODE_CONTINUOUS

//! DMA transfers 16 bits at a time.
#define DMA_CFG_SIZE_16BIT          0U
//! DMA transfers 32 bits at a time.
#define DMA_CFG_SIZE_32BIT          DMA_MODE_DATASIZE

//*****************************************************************************
//
//! Values that can be passed to DMA_configMode() as the \e trigger parameter.
//
//*****************************************************************************
typedef enum
{
	DMA_TRIGGER_SOFTWARE		 = 0,	//!TRIGGER SOFTWARE
	DMA_TRIGGER_ADCA1		 = 1,	//!TRIGGER ADCA1
	DMA_TRIGGER_ADCA2		 = 2,	//!TRIGGER ADCA2
	DMA_TRIGGER_ADCA3		 = 3,	//!TRIGGER ADCA3
	DMA_TRIGGER_ADCA4		 = 4,	//!TRIGGER ADCA4
	DMA_TRIGGER_ADCAEVT		 = 5,	//!TRIGGER ADCAEVT
	DMA_TRIGGER_ADCB1		 = 6,	//!TRIGGER ADCB1
	DMA_TRIGGER_ADCB2		 = 7,	//!TRIGGER ADCB2
	DMA_TRIGGER_ADCB3		 = 8,	//!TRIGGER ADCB3
	DMA_TRIGGER_ADCB4		 = 9,	//!TRIGGER ADCB4
	DMA_TRIGGER_ADCBEVT		 = 10,	//!TRIGGER ADCBEVT
	DMA_TRIGGER_ADCC1		 = 11,	//!TRIGGER ADCC1
	DMA_TRIGGER_ADCC2		 = 12,	//!TRIGGER ADCC2
	DMA_TRIGGER_ADCC3		 = 13,	//!TRIGGER ADCC3
	DMA_TRIGGER_ADCC4		 = 14,	//!TRIGGER ADCC4
	DMA_TRIGGER_ADCCEVT		 = 15,	//!TRIGGER ADCCEVT
	DMA_TRIGGER_ADCD1		 = 16,	//!TRIGGER ADCD1
	DMA_TRIGGER_ADCD2		 = 17,	//!TRIGGER ADCD2
	DMA_TRIGGER_ADCD3		 = 18,	//!TRIGGER ADCD3
	DMA_TRIGGER_ADCD4		 = 19,	//!TRIGGER ADCD4
	DMA_TRIGGER_ADCDEVT		 = 20,	//!TRIGGER ADCDEVT
	DMA_TRIGGER_CLA1		 = 21,	//!TRIGGER CLA1
	DMA_TRIGGER_CLA2		 = 22,	//!TRIGGER CLA2
	DMA_TRIGGER_CLA3		 = 23,	//!TRIGGER CLA3
	DMA_TRIGGER_CLA4		 = 24,	//!TRIGGER CLA4
	DMA_TRIGGER_CLA5		 = 25,	//!TRIGGER CLA5
	DMA_TRIGGER_CLA6		 = 26,	//!TRIGGER CLA6
	DMA_TRIGGER_CLA7		 = 27,	//!TRIGGER CLA7
	DMA_TRIGGER_CLA8		 = 28,	//!TRIGGER CLA8
	DMA_TRIGGER_XINT1		 = 29,	//!TRIGGER XINT1
	DMA_TRIGGER_XINT2		 = 30,	//!TRIGGER XINT2
	DMA_TRIGGER_XINT3		 = 31,	//!TRIGGER XINT3
	DMA_TRIGGER_XINT4		 = 32,	//!TRIGGER XINT4
	DMA_TRIGGER_XINT5		 = 33,	//!TRIGGER XINT5
	DMA_TRIGGER_EPWM1SOCA		 = 36,	//!TRIGGER EPWM1SOCA
	DMA_TRIGGER_EPWM1SOCB		 = 37,	//!TRIGGER EPWM1SOCB
	DMA_TRIGGER_EPWM2SOCA		 = 38,	//!TRIGGER EPWM2SOCA
	DMA_TRIGGER_EPWM2SOCB		 = 39,	//!TRIGGER EPWM2SOCB
	DMA_TRIGGER_EPWM3SOCA		 = 40,	//!TRIGGER EPWM3SOCA
	DMA_TRIGGER_EPWM3SOCB		 = 41,	//!TRIGGER EPWM3SOCB
	DMA_TRIGGER_EPWM4SOCA		 = 42,	//!TRIGGER EPWM4SOCA
	DMA_TRIGGER_EPWM4SOCB		 = 43,	//!TRIGGER EPWM4SOCB
	DMA_TRIGGER_EPWM5SOCA		 = 44,	//!TRIGGER EPWM5SOCA
	DMA_TRIGGER_EPWM5SOCB		 = 45,	//!TRIGGER EPWM5SOCB
	DMA_TRIGGER_EPWM6SOCA		 = 46,	//!TRIGGER EPWM6SOCA
	DMA_TRIGGER_EPWM6SOCB		 = 47,	//!TRIGGER EPWM6SOCB
	DMA_TRIGGER_EPWM7SOCA		 = 48,	//!TRIGGER EPWM7SOCA
	DMA_TRIGGER_EPWM7SOCB		 = 49,	//!TRIGGER EPWM7SOCB
	DMA_TRIGGER_EPWM8SOCA		 = 50,	//!TRIGGER EPWM8SOCA
	DMA_TRIGGER_EPWM8SOCB		 = 51,	//!TRIGGER EPWM8SOCB
	DMA_TRIGGER_EPWM9SOCA		 = 52,	//!TRIGGER EPWM9SOCA
	DMA_TRIGGER_EPWM9SOCB		 = 53,	//!TRIGGER EPWM9SOCB
	DMA_TRIGGER_EPWM10SOCA		 = 54,	//!TRIGGER EPWM10SOCA
	DMA_TRIGGER_EPWM10SOCB		 = 55,	//!TRIGGER EPWM10SOCB
	DMA_TRIGGER_EPWM11SOCA		 = 56,	//!TRIGGER EPWM11SOCA
	DMA_TRIGGER_EPWM11SOCB		 = 57,	//!TRIGGER EPWM11SOCB
	DMA_TRIGGER_EPWM12SOCA		 = 58,	//!TRIGGER EPWM12SOCA
	DMA_TRIGGER_EPWM12SOCB		 = 59,	//!TRIGGER EPWM12SOCB
	DMA_TRIGGER_TINT0		 = 68,	//!TRIGGER TINT0
	DMA_TRIGGER_TINT1		 = 69,	//!TRIGGER TINT1
	DMA_TRIGGER_TINT2		 = 70,	//!TRIGGER TINT2
	DMA_TRIGGER_ECAP1		 = 75,	//!TRIGGER ECAP1
	DMA_TRIGGER_ECAP2		 = 76,	//!TRIGGER ECAP2
	DMA_TRIGGER_LINATX		 = 99,	//!TRIGGER LINATX
	DMA_TRIGGER_LINARX		 = 100,	//!TRIGGER LINARX
	DMA_TRIGGER_SPIATX		 = 109,	//!TRIGGER SPIATX
	DMA_TRIGGER_SPIARX		 = 110,	//!TRIGGER SPIARX
	DMA_TRIGGER_SPIBTX		 = 111,	//!TRIGGER SPIBTX
	DMA_TRIGGER_SPIBRX		 = 112,	//!TRIGGER SPIBRX
	DMA_TRIGGER_FSITXA		 = 123,	//!TRIGGER FSITXA
	DMA_TRIGGER_FSIA_DATA_TAG_MATCH		 = 124,	//!TRIGGER FSIA DATA TAG MATCH
	DMA_TRIGGER_FSIRXA		 = 125,	//!TRIGGER FSIRXA
	DMA_TRIGGER_FSIA_PING_TAG_MATCH		 = 126,	//!TRIGGER FSIA PING TAG MATCH
	DMA_TRIGGER_CLB1INT		 = 127,	//!TRIGGER CLB1INT
	DMA_TRIGGER_CLB2INT		 = 128,	//!TRIGGER CLB2INT
	DMA_TRIGGER_USBA_RX1		 = 131,	//!TRIGGER USBA RX1
	DMA_TRIGGER_USBA_TX1		 = 132,	//!TRIGGER USBA TX1
	DMA_TRIGGER_USBA_RX2		 = 133,	//!TRIGGER USBA RX2
	DMA_TRIGGER_USBA_TX2		 = 134,	//!TRIGGER USBA TX2
	DMA_TRIGGER_USBA_RX3		 = 135,	//!TRIGGER USBA RX3
	DMA_TRIGGER_USBA_TX3		 = 136,	//!TRIGGER USBA TX3
	DMA_TRIGGER_ADCE1		 = 137,	//!TRIGGER ADCE1
	DMA_TRIGGER_ADCE2		 = 138,	//!TRIGGER ADCE2
	DMA_TRIGGER_ADCE3		 = 139,	//!TRIGGER ADCE3
	DMA_TRIGGER_ADCE4		 = 140,	//!TRIGGER ADCE4
	DMA_TRIGGER_ADCEEVT		 = 141,	//!TRIGGER ADCEEVT
	DMA_TRIGGER_AESA_CONTEXTIN		 = 180,	//!TRIGGER AESA CONTEXTIN
	DMA_TRIGGER_AESA_DATAIN		 = 181,	//!TRIGGER AESA DATAIN
	DMA_TRIGGER_AESA_CONTEXTOUT		 = 182,	//!TRIGGER AESA CONTEXTOUT
	DMA_TRIGGER_AESA_DATAOUT		 = 183,	//!TRIGGER AESA DATAOUT
	DMA_TRIGGER_EPG1		 = 184	//!TRIGGER EPG1
} DMA_Trigger;


//*****************************************************************************
//
//! Values that can be passed to DMA_setInterruptMode() as the \e mode
//! parameter.
//
//*****************************************************************************
typedef enum
{
    //! DMA interrupt is generated at the beginning of a transfer
    DMA_INT_AT_BEGINNING,
    //! DMA interrupt is generated at the end of a transfer
    DMA_INT_AT_END
} DMA_InterruptMode;

//*****************************************************************************
//
//! Values that can be passed to DMA_setEmulationMode() as the \e mode
//! parameter.
//
//*****************************************************************************
typedef enum
{
    //! Transmission stops after current read-write access is completed
    DMA_EMULATION_STOP,
    //! Continue DMA operation regardless of emulation suspend
    DMA_EMULATION_FREE_RUN
} DMA_EmulationMode;

//*****************************************************************************
//
//! Values that can be passed to DMA_configChannel() as the
//! configure parameter.
//
//*****************************************************************************
typedef struct
{
    DMA_Trigger          transferTrigger;  //DMA transfer triggers
    DMA_InterruptMode    interruptMode;    //Channel interrupt mode
    //! enableInterrupt can have a value 1(Enable) or 0(Disable)
    bool                 enableInterrupt;  //Enable/Disable interrupt mode
    //! configSize can have a value DMA_CFG_SIZE_16BIT/32BIT
    uint32_t             configSize;    //Data bus width (16 or 32 bits)
    //! transferMode can have a value DMA_CFG_ONESHOT_DISABLE/ENABLE
    uint32_t             transferMode;  //Burst transfer mode
    //! reinitMode can have a value DMA_CFG_CONTINUOUS_DISABLE/ENABLE
    uint32_t             reinitMode;    //DMA reinitialization mode
    //! burstSize value range from 1 word to 32 sixteen-bit words.
    uint32_t             burstSize;     //Number of words transferred per burst
    //! transferSize value range from 1 to 65536
    uint32_t             transferSize;  //Number of bursts per transfer
    //! Number of bursts to be transferred before a wrap of the source address
    //! occurs. srcWrapSize value range from 1 to 65536
    uint32_t             srcWrapSize;
    //! Number of bursts to be transferred before a wrap of the destination
    //! address occurs. destWrapSize value range from 1 to 65536
    uint32_t             destWrapSize;
    uint32_t             destAddr;    //destination address
    uint32_t             srcAddr;     //source address
    //! Amount to inc or dec the source address after each word of a burst.
    //! srcBurstStep can have only signed values from -4096 to 4095
    int16_t              srcBurstStep;
    //! Amount to inc or dec the destination address after each word of a burst.
    //! destBurstStep can have only signed values from -4096 to 4095
    int16_t              destBurstStep;
    //! Amount to inc or dec the source address after each burst of a transfer.
    //! srcTransferStep can have only signed values from -4096 to 4095
    int16_t              srcTransferStep;
    //! Amount to inc or dec the destination address after each burst of a
    //! transfer. destTransferStep can have only signed values from -4096 to 4095
    int16_t              destTransferStep;
    //! Amount to inc or dec the source address when the wrap occurs.
    //! srcWrapStep can have only signed values from -4096 to 4095
    int16_t              srcWrapStep;
    //! Amount to inc or dec the destination address when the wrap occurs.
    //! destWrapStep can have only signed values from -4096 to 4095
    int16_t              destWrapStep;

} DMA_ConfigParams;

//*****************************************************************************
//
// Prototypes for the APIs.
//
//*****************************************************************************
//*****************************************************************************
//
//! \internal
//! Checks an DMA channel base address.
//!
//! \param base specifies the DMA channel base address.
//!
//! This function determines if a DMA channel base address is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static inline bool
DMA_isBaseValid(uint32_t base)
{
    return((base == DMA_CH1_BASE) || (base == DMA_CH2_BASE) ||
           (base == DMA_CH3_BASE) || (base == DMA_CH4_BASE) ||
           (base == DMA_CH5_BASE) || (base == DMA_CH6_BASE));
}
#endif

//*****************************************************************************
//
//! Initializes the DMA controller to a known state.
//!
//! This function configures does a hard reset of the DMA controller in order
//! to put it into a known state. The function also sets the DMA to run free
//! during an emulation suspend (see the field DEBUGCTRL.FREE for more info).
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_initController(void)
{
    EALLOW;

    //
    // Set the hard reset bit. One NOP is required after HARDRESET.
    //
    HWREGH(DMA_BASE + DMA_O_CTRL) |= DMA_CTRL_HARDRESET;
    NOP;

    EDIS;
}

//*****************************************************************************
//
//! Channel Soft Reset
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function does a soft reset to place the channel into its default state
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_triggerSoftReset(uint32_t base)
{
    EALLOW;

    //
    // Set the soft reset bit. One NOP is required after SOFTRESET.
    //
    HWREGH(base + DMA_O_CONTROL) |= DMA_CONTROL_SOFTRESET;
    NOP;

    EDIS;
}

//*****************************************************************************
//
//! Sets DMA emulation mode.
//!
//! \param mode is the emulation mode to be selected.
//!
//! This function sets the behavior of the DMA operation when an emulation
//! suspend occurs. The \e mode parameter can be one of the following:
//!
//! - \b DMA_EMULATION_STOP - DMA runs until the current read-write access is
//!   completed.
//! - \b DMA_EMULATION_FREE_RUN - DMA operation continues regardless of a
//!   the suspend.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_setEmulationMode(DMA_EmulationMode mode)
{
    EALLOW;

    //
    // Set emulation mode
    //
    if(mode == DMA_EMULATION_STOP)
    {
        HWREGH(DMA_BASE + DMA_O_DEBUGCTRL) &= ~DMA_DEBUGCTRL_FREE;
    }
    else
    {
        HWREGH(DMA_BASE + DMA_O_DEBUGCTRL) |= DMA_DEBUGCTRL_FREE;
    }

    EDIS;
}

//*****************************************************************************
//
//! Enables peripherals to trigger a DMA transfer.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function enables the selected peripheral trigger to start a DMA
//! transfer on the specified channel.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_enableTrigger(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_isBaseValid(base));

    //
    // Set the peripheral interrupt trigger enable bit.
    //
    EALLOW;
    HWREGH(base + DMA_O_MODE) |= DMA_MODE_PERINTE;
    EDIS;
}

//*****************************************************************************
//
//! Disables peripherals from triggering a DMA transfer.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function disables the selected peripheral trigger from starting a DMA
//! transfer on the specified channel. This also disables the use of the
//! software force using the DMA_forceTrigger() API.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_disableTrigger(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_isBaseValid(base));

    //
    // Clear the peripheral interrupt trigger enable bit.
    //
    EALLOW;
    HWREGH(base + DMA_O_MODE) &= ~DMA_MODE_PERINTE;
    EDIS;
}

//*****************************************************************************
//
//! Force a peripheral trigger to a DMA channel.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function sets the peripheral trigger flag and if triggering a DMA
//! burst is enabled (see DMA_enableTrigger()), a DMA burst transfer will be
//! forced.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_forceTrigger(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_isBaseValid(base));

    //
    // Set the peripheral interrupt trigger force bit.
    //
    EALLOW;
    HWREGH(base + DMA_O_CONTROL) |= DMA_CONTROL_PERINTFRC;
    EDIS;
}

//*****************************************************************************
//
//! Clears a DMA channel's peripheral trigger flag.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function clears the peripheral trigger flag. Normally, you would use
//! this function when initializing the DMA for the first time. The flag is
//! cleared automatically when the DMA starts the first burst of a transfer.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_clearTriggerFlag(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_isBaseValid(base));

    //
    // Write a one to the clear bit to clear the peripheral trigger flag.
    //
    EALLOW;
    HWREGH(base + DMA_O_CONTROL) |= DMA_CONTROL_PERINTCLR;
    EDIS;
}

//*****************************************************************************
//
//! Gets the status of a DMA channel's Transfer Status Flag.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function returns \b true if the Transfer Status Flag is set, which
//! means a DMA transfer has begun.
//! This flag is cleared when TRANSFER_COUNT reaches zero, or when the
//! HARDRESET or SOFTRESET bit is set.
//!
//! \return Returns \b true if the Transfer Status Flag is set. Returns \b false
//! otherwise.
//
//*****************************************************************************
static inline bool
DMA_getTransferStatusFlag(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_isBaseValid(base));

    //
    // Read the Transfer Status Flag and return appropriately.
    //
    return((HWREGH(base + DMA_O_CONTROL) & DMA_CONTROL_TRANSFERSTS) != 0U);
}

//*****************************************************************************
//
//! Gets the status of a DMA channel's Burst Status Flag.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function returns \b true if the Burst Status Flag is set, which
//! means a DMA burst has begun.
//! This flag is cleared when BURST_COUNT reaches zero, or when the
//! HARDRESET or SOFTRESET bit is set.
//!
//! \return Returns \b true if the Burst Status Flag is set. Returns \b false
//! otherwise.
//
//*****************************************************************************
static inline bool
DMA_getBurstStatusFlag(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_isBaseValid(base));

    //
    // Read the Burst Status Flag and return appropriately.
    //
    return((HWREGH(base + DMA_O_CONTROL) & DMA_CONTROL_BURSTSTS) != 0U);
}

//*****************************************************************************
//
//! Gets the status of a DMA channel's Run Status Flag.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function returns \b true if the Run Status Flag is set, which
//! means the DMA channel is enabled.
//! This flag is cleared when a transfer completes (TRANSFER_COUNT = 0) and
//! continuous mode is disabled, or when the HARDRESET, SOFTRESET, or HALT bit
//! is set.
//!
//! \return Returns \b true if the channel is enabled. Returns \b false
//! otherwise.
//
//*****************************************************************************
static inline bool
DMA_getRunStatusFlag(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_isBaseValid(base));

    //
    // Read the Run Status Flag and return appropriately.
    //
    return((HWREGH(base + DMA_O_CONTROL) & DMA_CONTROL_RUNSTS) != 0U);
}

//*****************************************************************************
//
//! Gets the status of a DMA channel's Overflow Flag.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function returns \b true if the Overflow Flag is set, which
//! means peripheral event trigger was received while Peripheral Event Trigger
//! Flag was already set.
//! This flag can be cleared by writing to ERRCLR bit, using the function
//! DMA_clearErrorFlag().
//!
//! \return Returns \b true if the channel is enabled. Returns \b false
//! otherwise.
//
//*****************************************************************************
static inline bool
DMA_getOverflowFlag(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_isBaseValid(base));

    //
    // Read the Overflow Flag and return appropriately.
    //
    return((HWREGH(base + DMA_O_CONTROL) & DMA_CONTROL_OVRFLG) != 0U);
}

//*****************************************************************************
//
//! Gets the status of a DMA channel's peripheral trigger flag.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function returns \b true if a peripheral trigger event has occurred
//! The flag is automatically cleared when the first burst transfer begins, but
//! if needed, it can be cleared using DMA_clearTriggerFlag().
//!
//! \return Returns \b true if a peripheral trigger event has occurred and its
//! flag is set. Returns \b false otherwise.
//
//*****************************************************************************
static inline bool
DMA_getTriggerFlagStatus(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_isBaseValid(base));

    //
    // Read the peripheral trigger flag and return appropriately.
    //
    return((HWREGH(base + DMA_O_CONTROL) & DMA_CONTROL_PERINTFLG) != 0U);
}

//*****************************************************************************
//
//! Starts a DMA channel.
//!
//! \param base is the base address of the DMA channel control registers.
//!
//! This function starts the DMA running, typically after you have configured
//! it. It will wait for the first trigger event to start operation. To halt
//! the channel use DMA_stopChannel().
//!
//! \return None.
//
//*****************************************************************************
static inline void
DMA_startChannel(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DMA_isBaseValid(base));

    //
    // Set the run bit.
    //
    EALLOW;
    HWREGH(base + DMA_O_CONTROL) |= DMA_CONTROL_RUN;
    EDIS;
}

